Мюнцкабинент_30/src/InformationRegisters/ПочтовыеИдентификаторы/ПочтовыеИдентификаторы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеИдентификаторы</name>
  <comment>Почтовые идентификаторы для отслеживания отправлений</comment>
  <resources>
    <name>ТипИдентификатора</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыПочтовыхИдентификаторов</types>
    </type>
  </resources>
  <resources>
    <name>ПочтовыйИдентификатор</name>
    <type>
      <types>Characteristic.ВидыПочтовыхИдентификаторов</types>
    </type>
  </resources>
  <attributes>
    <name>ВрученАдресату</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИндексПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийСтатус</name>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредыдущийСтатус</name>
    <comment>Для контроля изменения статуса</comment>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОтслеживаемыеПочтовыеОтправления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/ПочтовыеТреки/ПочтовыеТреки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеТреки</name>
  <comment>Прохождение почтовых отправлений</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПочтовоеОтделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ПочтовыеОперации</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОтслеживаемыеПочтовыеОтправления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/CommonModules/РегламентныеЗаданияМюнцкабинет/Module.bsl
Процедура ОтслеживаниеПочтовыхОтправлений() Экспорт
	
	ЗаписьЖурналаРегистрации("ОтслеживаниеПочтовыхОтправлений", УровеньЖурналаРегистрации.Информация,,,"Начало проверки.");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 10
		|	ПочтовыеИдентификаторы.Документ,
		|	ПочтовыеИдентификаторы.ПочтовыйИдентификатор
		|ИЗ
		|	РегистрСведений.ПочтовыеИдентификаторы КАК ПочтовыеИдентификаторы
		|ГДЕ
		|	НЕ ПочтовыеИдентификаторы.ВрученАдресату";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ПочтовоеОтправление = РегистрыСведений.ПочтовыеИдентификаторы.ПолучитьИнформациюОПочтовомОтправлении(Выборка.Документ);
		Если ПочтовоеОтправление <> Неопределено Тогда
			Если НЕ ПочтовоеОтправление.ВрученАдресату Тогда
				Если Константы.ИспользоватьСервисПочтыРФ.Получить() Тогда
					Треки = РаботаСПочтовымиОтправлениями.ОтслеживаниеРПО(ПочтовоеОтправление.ПочтовыйИдентификатор);
				Иначе	
					Треки = РаботаСПочтовымиОтправлениями.ПолучитьИнформациюПоТрекуНаСервере (ПочтовоеОтправление.ПочтовыйИдентификатор);
				КонецЕсли;
			
				Если Треки.Количество () > 0 Тогда
					РегистрыСведений.ПочтовыеТреки.ОбновитьИнформациюПоТреку (Выборка.Документ, Треки);	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("ОтслеживаниеПочтовыхОтправлений", УровеньЖурналаРегистрации.Информация,,,"Окончание проверки.");

КонецПроцедуры
